{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "sUm7kokski_K"
   },
   "source": [
    "# SPARQL"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "FlaljkGCkn_Q"
   },
   "source": [
    "This document contains a short introduction to [SPARQL](https://www.w3.org/TR/sparql11-query/) using [rudof](https://rudof-project.github.io/).\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "whZHWrGG6Y8O"
   },
   "source": [
    "## Preliminaries"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "YpF48mZrjqwo"
   },
   "source": [
    "The library is available as `pyrudof`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "colab": {
     "base_uri": "https://localhost:8080/"
    },
    "id": "voGWk2uO6gcP",
    "outputId": "f883101c-f508-48f3-e549-f1b0fc705833"
   },
   "outputs": [],
   "source": [
    "!pip install pyrudof"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "FzsA78qu-xXP"
   },
   "source": [
    "The main entry point if a class called `Rudof` through which most of the functionality is provided."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {
    "id": "I3jvDAPBJ3OQ"
   },
   "outputs": [],
   "source": [
    "from pyrudof import Rudof, RudofConfig"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "0Io7V7y9_G_P"
   },
   "source": [
    "In order to initialize that class, it is possible to pass a RudofConfig instance which contains configuration parameters for customization."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {
    "id": "OAV_KSrH6qn-"
   },
   "outputs": [],
   "source": [
    "rudof = Rudof(RudofConfig())"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "rCOlUq9H_5b2"
   },
   "source": [
    "## SPARQL queries with local RDF data"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "A3nPgQ8zI1-e"
   },
   "source": [
    "As SPARQL is an RDF query language, we first need some RDF data.\n",
    "\n",
    "rudof can run queries against local RDF data or RDF that is available through some SPARQL endpoint.\n",
    "\n",
    "Let's start with some local RDF data."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {
    "id": "WH2rBJ5b_8go"
   },
   "outputs": [],
   "source": [
    "rdf = \"\"\"\n",
    "prefix :    <http://example.org/>\n",
    "prefix xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "\n",
    ":alice a :Person ;\n",
    " :name      \"Alice\"                ;\n",
    " :birthDate \"2005-03-01\"^^xsd:date ;\n",
    " :worksFor  :acme                   .\n",
    ":bob a :Person   ;\n",
    " :name      \"Robert Smith\"         ;\n",
    " :birthDate \"2003-01-02\"^^xsd:date ;\n",
    " :worksFor  :acme  .\n",
    ":acme a :Company ;\n",
    " :name \"Acme Inc.\" .\n",
    "\"\"\"\n",
    "rudof.read_data(rdf)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "YLIV8NRzKO24"
   },
   "source": [
    "We can run SPARQL queries as follows:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {
    "id": "ags_QBb4DVaC"
   },
   "outputs": [],
   "source": [
    "query = \"\"\"\n",
    "PREFIX : <http://example.org/>\n",
    "\n",
    "SELECT ?person ?name ?date ?company WHERE {\n",
    "  ?person a          :Person ;\n",
    "          :name      ?name   ;\n",
    "          :birthDate ?date   ;\n",
    "          :worksFor  ?c   .\n",
    "  ?c      :name      ?company .\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "rudof.read_query(query)\n",
    "rudof.run_query()\n",
    "results = rudof.serialize_query_results()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "w4x5cYh-CBnP"
   },
   "source": [
    "Show the results:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {
    "colab": {
     "base_uri": "https://localhost:8080/"
    },
    "id": "t8Bp-fcSCDsW",
    "outputId": "8328701a-9f4a-43c1-fc6f-719aa4f861ef"
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "╭───┬─────────┬────────────────┬───────────────────────────────────────────────────────┬─────────────╮\n",
      "│   │ ?person │ ?name          │ ?date                                                 │ ?company    │\n",
      "├───┼─────────┼────────────────┼───────────────────────────────────────────────────────┼─────────────┤\n",
      "│ 1 │ :bob    │ \"Robert Smith\" │ \"2003-01-02\"^^<http://www.w3.org/2001/XMLSchema#date> │ \"Acme Inc.\" │\n",
      "├───┼─────────┼────────────────┼───────────────────────────────────────────────────────┼─────────────┤\n",
      "│ 2 │ :alice  │ \"Alice\"        │ \"2005-03-01\"^^<http://www.w3.org/2001/XMLSchema#date> │ \"Acme Inc.\" │\n",
      "╰───┴─────────┴────────────────┴───────────────────────────────────────────────────────┴─────────────╯\n",
      "\n"
     ]
    }
   ],
   "source": [
    "print(results)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {
    "id": "_XccjYtQNm63"
   },
   "outputs": [],
   "source": [
    "rudof.reset_all()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "-a2VO8dFKcn_"
   },
   "source": [
    "## SPARQL queries with an endpoint"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "MTwPucenKoYn"
   },
   "source": [
    "It is also possible to run SPARQL queries against SPARQL endpoints.\n",
    "\n",
    "SPARQL endpoints are usually identified by an IRI.\n",
    "\n",
    "rudof contains a list of popular SPARQL endpoints which can also be identified by name, like wikidata, whose IRI is: https://query.wikidata.org/sparql"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {
    "id": "idcwGDNWNlgX"
   },
   "outputs": [],
   "source": [
    "query = \"\"\"\n",
    "PREFIX wd: <http://www.wikidata.org/entity/>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "PREFIX wdt: <http://www.wikidata.org/prop/direct/>\n",
    "SELECT ?person ?occupation WHERE {\n",
    "    ?p wdt:P31 wd:Q5 ;\n",
    "          wdt:P106 ?o ;\n",
    "          rdfs:label ?person ;\n",
    "          wdt:P19 wd:Q14317 .\n",
    "  ?o rdfs:label ?occupation\n",
    "  FILTER (lang(?person) = \"en\" && lang(?occupation) = \"en\")\n",
    "}\n",
    "LIMIT 10\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {
    "id": "gbrqFmkqNzc-"
   },
   "outputs": [],
   "source": [
    "rudof.read_data(endpoint=\"https://query.wikidata.org/sparql\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {
    "id": "7tQSbSZlRbeH"
   },
   "outputs": [],
   "source": [
    "rudof.read_query(query)\n",
    "rudof.run_query()\n",
    "results = rudof.serialize_query_results()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {
    "colab": {
     "base_uri": "https://localhost:8080/"
    },
    "id": "QhntEKe9O-xX",
    "outputId": "4e012fb0-6eb4-476e-ca66-2e8c470d6a49"
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "╭────┬──────────────────────────────────────────┬────────────────────────╮\n",
      "│    │ ?person                                  │ ?occupation            │\n",
      "├────┼──────────────────────────────────────────┼────────────────────────┤\n",
      "│ 1  │ \"Elena Fernández\"en                      │ \"actor\"en              │\n",
      "├────┼──────────────────────────────────────────┼────────────────────────┤\n",
      "│ 2  │ \"Luciano García del Real\"en              │ \"writer\"en             │\n",
      "├────┼──────────────────────────────────────────┼────────────────────────┤\n",
      "│ 3  │ \"Mercedes Neuschäfer-Carlón\"en           │ \"writer\"en             │\n",
      "├────┼──────────────────────────────────────────┼────────────────────────┤\n",
      "│ 4  │ \"Javier Almuzara\"en                      │ \"writer\"en             │\n",
      "├────┼──────────────────────────────────────────┼────────────────────────┤\n",
      "│ 5  │ \"Leticia Sánchez Ruiz\"en                 │ \"writer\"en             │\n",
      "├────┼──────────────────────────────────────────┼────────────────────────┤\n",
      "│ 6  │ \"Alberto Rionda\"en                       │ \"composer\"en           │\n",
      "├────┼──────────────────────────────────────────┼────────────────────────┤\n",
      "│ 7  │ \"Fernando Alonso\"en                      │ \"Formula One driver\"en │\n",
      "├────┼──────────────────────────────────────────┼────────────────────────┤\n",
      "│ 8  │ \"Carlos Tartiere de las Alas Pumariño\"en │ \"businessperson\"en     │\n",
      "├────┼──────────────────────────────────────────┼────────────────────────┤\n",
      "│ 9  │ \"Jesús Lobato de Blas\"en                 │ \"writer\"en             │\n",
      "├────┼──────────────────────────────────────────┼────────────────────────┤\n",
      "│ 10 │ \"Fernando Alonso\"en                      │ \"vegetarian\"en         │\n",
      "╰────┴──────────────────────────────────────────┴────────────────────────╯\n",
      "\n"
     ]
    }
   ],
   "source": [
    "print(results)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {
    "id": "1CW79IYHPEwz"
   },
   "outputs": [],
   "source": [
    "rudof.reset_all()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "fj_-kDkyQKOE"
   },
   "source": [
    "## Federated queries"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "HKbWZqWaQMqD"
   },
   "source": [
    "TBD"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "3eimits8OMXb"
   },
   "source": [
    "## CONSTRUCT queries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {
    "id": "MDafK9dL626B"
   },
   "outputs": [],
   "source": [
    "from pyrudof import QueryResultFormat"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "JmZOY0QNOQgl"
   },
   "source": [
    "It is also possible to run SPARQL CONSTRUCT queries which can be used to return RDF results.\n",
    "\n",
    "For example:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {
    "id": "EaT5nZ4kOb2L"
   },
   "outputs": [],
   "source": [
    "query = \"\"\"\n",
    "PREFIX wd:  <http://www.wikidata.org/entity/>\n",
    "PREFIX wdt: <http://www.wikidata.org/prop/direct/>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "PREFIX :    <http://example.org/>\n",
    "\n",
    "CONSTRUCT {\n",
    "   ?p a     :Person ;\n",
    "      :name ?person ;\n",
    "      :occupation ?occupation\n",
    "} WHERE {\n",
    "    ?p wdt:P31 wd:Q5 ;\n",
    "          wdt:P106 ?o ;\n",
    "          rdfs:label ?person ;\n",
    "          wdt:P19 wd:Q14317 .\n",
    "  ?o rdfs:label ?occupation\n",
    "  FILTER (lang(?person) = \"en\" && lang(?occupation) = \"en\")\n",
    "}\n",
    "LIMIT 10\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "1Fn7b37nPOrT"
   },
   "source": [
    "We indicate rudof that we will use Wikidata's endpoint:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {
    "id": "ManQHdQwO9B0"
   },
   "outputs": [],
   "source": [
    "rudof.read_data(endpoint=\"https://query.wikidata.org/sparql\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {
    "id": "zhnAJGzDPNns"
   },
   "outputs": [],
   "source": [
    "rudof.read_query(query)\n",
    "rudof.run_query()\n",
    "result = rudof.serialize_query_results(QueryResultFormat.Turtle)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {
    "colab": {
     "base_uri": "https://localhost:8080/"
    },
    "id": "eQYxOLSbPmsL",
    "outputId": "37abed28-c065-4af9-d310-bbb0786dbfd0"
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "@prefix rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> .\n",
      "@prefix rdfs: <http://www.w3.org/2000/01/rdf-schema#> .\n",
      "@prefix sesame: <http://www.openrdf.org/schema/sesame#> .\n",
      "@prefix owl: <http://www.w3.org/2002/07/owl#> .\n",
      "@prefix xsd: <http://www.w3.org/2001/XMLSchema#> .\n",
      "@prefix fn: <http://www.w3.org/2005/xpath-functions#> .\n",
      "@prefix foaf: <http://xmlns.com/foaf/0.1/> .\n",
      "@prefix dc: <http://purl.org/dc/elements/1.1/> .\n",
      "@prefix hint: <http://www.bigdata.com/queryHints#> .\n",
      "@prefix bd: <http://www.bigdata.com/rdf#> .\n",
      "@prefix bds: <http://www.bigdata.com/rdf/search#> .\n",
      "@prefix psn: <http://www.wikidata.org/prop/statement/value-normalized/> .\n",
      "@prefix pqn: <http://www.wikidata.org/prop/qualifier/value-normalized/> .\n",
      "@prefix prn: <http://www.wikidata.org/prop/reference/value-normalized/> .\n",
      "@prefix mwapi: <https://www.mediawiki.org/ontology#API/> .\n",
      "@prefix gas: <http://www.bigdata.com/rdf/gas#> .\n",
      "@prefix wdsubgraph: <https://query.wikidata.org/subgraph/> .\n",
      "@prefix wdt: <http://www.wikidata.org/prop/direct/> .\n",
      "@prefix wdtn: <http://www.wikidata.org/prop/direct-normalized/> .\n",
      "@prefix psv: <http://www.wikidata.org/prop/statement/value/> .\n",
      "@prefix ps: <http://www.wikidata.org/prop/statement/> .\n",
      "@prefix pqv: <http://www.wikidata.org/prop/qualifier/value/> .\n",
      "@prefix pq: <http://www.wikidata.org/prop/qualifier/> .\n",
      "@prefix prv: <http://www.wikidata.org/prop/reference/value/> .\n",
      "@prefix pr: <http://www.wikidata.org/prop/reference/> .\n",
      "@prefix wdno: <http://www.wikidata.org/prop/novalue/> .\n",
      "@prefix p: <http://www.wikidata.org/prop/> .\n",
      "@prefix wikibase: <http://wikiba.se/ontology#> .\n",
      "@prefix wd: <http://www.wikidata.org/entity/> .\n",
      "@prefix wdata: <http://www.wikidata.org/wiki/Special:EntityData/> .\n",
      "@prefix wds: <http://www.wikidata.org/entity/statement/> .\n",
      "@prefix wdv: <http://www.wikidata.org/value/> .\n",
      "@prefix wdref: <http://www.wikidata.org/reference/> .\n",
      "@prefix schema: <http://schema.org/> .\n",
      "@prefix prov: <http://www.w3.org/ns/prov#> .\n",
      "@prefix skos: <http://www.w3.org/2004/02/skos/core#> .\n",
      "@prefix geo: <http://www.opengis.net/ont/geosparql#> .\n",
      "@prefix geof: <http://www.opengis.net/def/geosparql/function/> .\n",
      "@prefix mediawiki: <https://www.mediawiki.org/ontology#> .\n",
      "@prefix ontolex: <http://www.w3.org/ns/lemon/ontolex#> .\n",
      "@prefix dct: <http://purl.org/dc/terms/> .\n",
      "@prefix wikibaseqs: <http://wikiba.se/queryService#> .\n",
      "\n",
      "wd:Q5973925 a <http://example.org/Person> ;\n",
      "\t<http://example.org/name> \"Leticia Sánchez Ruiz\"@en ;\n",
      "\t<http://example.org/occupation> \"writer\"@en .\n",
      "\n",
      "wd:Q5983724 a <http://example.org/Person> ;\n",
      "\t<http://example.org/name> \"Luis José de Ávila\"@en ;\n",
      "\t<http://example.org/occupation> \"journalist\"@en .\n",
      "\n",
      "wd:Q168363 a <http://example.org/Person> ;\n",
      "\t<http://example.org/name> \"Ramiro I of Asturias\"@en ;\n",
      "\t<http://example.org/occupation> \"ruler\"@en .\n",
      "\n",
      "wd:Q10514 a <http://example.org/Person> ;\n",
      "\t<http://example.org/name> \"Fernando Alonso\"@en ;\n",
      "\t<http://example.org/occupation> \"vegetarian\"@en .\n",
      "\n",
      "wd:Q27688 a <http://example.org/Person> ;\n",
      "\t<http://example.org/name> \"Javier Paredes\"@en ;\n",
      "\t<http://example.org/occupation> \"association football player\"@en .\n",
      "\n",
      "wd:Q10514 <http://example.org/occupation> \"Formula One driver\"@en .\n",
      "\n",
      "wd:Q8776277 a <http://example.org/Person> ;\n",
      "\t<http://example.org/name> \"Enrique Vidal Abascal\"@en ;\n",
      "\t<http://example.org/occupation> \"astronomer\"@en .\n",
      "\n",
      "wd:Q201589 a <http://example.org/Person> ;\n",
      "\t<http://example.org/name> \"Queen Letizia of Spain\"@en ;\n",
      "\t<http://example.org/occupation> \"journalist\"@en , \"war correspondent\"@en , \"television presenter\"@en .\n",
      "\n",
      "\n"
     ]
    }
   ],
   "source": [
    "print(result)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "XghKhhb1Kc1V"
   },
   "source": [
    "## References\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "id": "_Uv4p9FaKhVk"
   },
   "source": [
    "### Resources for learning SPARQL\n",
    "\n",
    "*   [Learning SPARQL](https://learningsparql.com/) book and blog by Bob Ducharne.\n",
    "*   [SPARQL tutorial](https://www.wikidata.org/wiki/Wikidata:SPARQL_tutorial) from Wikidata\n",
    "\n",
    "### Lists of SPARQL endpoints\n",
    "\n",
    "*   [SPARQL endpoints](https://www.wikidata.org/wiki/Wikidata:Lists/SPARQL_endpoints) collected in Wikidata\n",
    "*   [SPARQL endpoints](https://www.w3.org/wiki/SparqlEndpoints) collected at W3C.\n",
    "\n"
   ]
  }
 ],
 "metadata": {
  "colab": {
   "provenance": [],
   "toc_visible": true
  },
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.13.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 0
}
